<?
$json = '
[
	[
		"Содержанием исполняемых обя​занностей,",
		"Возможностью оказывать влияние на других людей или ход событий"
	],
	[
		"Сроками исполнения своих обяза​тельств,",
		"Обговоренной ранее трудовой нагрузкой"
	],
	[
		"Возможностью получить причитаю щееся материальное вознагражде​ние,",
		"Исполнением другими их обяза​тельств"
	],
	[
		"Возможностью оказывать влияние на других людей или ход событий,",
		"Возможностью сделать карьеру"
	],
	[
		"Привычным порядком дел на предприятии,",
		"Причастностью к «ближнему кру​гу» (близостью к команде руководителя)"
	],
	[
		"Содержанием исполняемых обя​занностей,",
		"Возможностью получить более высокооплачиваемую работу"
	],
	[
		"Собственными принципами,",
		"Традициями организации, деклари​руемыми принципами и ценностями"
	],
	[
		"Нормативными показателями дея​тельности, в том числе и нормами профессиональной этики,",
		"Привычным порядком дел на предприятии"
	],
	[
		"Сроками исполнения своих обяза​тельств,",
		"«Журавлем в небе», если под этим под- разумевается участие в проекте потенциально перспективном, но рискованном"
	],
	[
		"Обговоренной ранее трудовой нагрузкой,",
		"Нормативными показателями деятельности, в том числе и нормами профессиональной этики"
	],
	[
		"Содержанием исполняемых обя​занностей,",
		"Возможностью получить причи​тающееся материальное вознагражде​ние"
	],
	[
		"Точным соответствием результа​та деятельности обговоренным условиям,",
		"Безопасностью (в широком смысле), стабильностью положения своих коллег"
	],
	[
		"Причастностью к «ближнему кругу» (к команде руководителя),",
		"Исполнением другими их обяза​тельств"
	],
	[
		"Удобством, комфортом, возмож​ностью минимизировать собственные усилия,",
		"Поддержанием собственной безопасности, стабильности положе​ния (в широком смысле)"
	],
	[
		"Привычным порядком дел на предприятии,",
		"Возможностью получить причи​тающееся материальное вознагражде​ние"
	],
	[
		"Возможностью поддерживать самооценку, «сохранить свое лицо»,",
		"Причастностью к «ближнему кругу» (к команде руководителя)"
	],
	[
		"Возможностью получить более высокооплачиваемую работу,",
		"Обговоренной ранее трудовой нагрузкой"
	],
	[
		"Поддержкой своих друзей,",
		"Оценкой руководства"
	],
	[
		"«Журавлем в небе», если под этим подразумевается участие в проекте перспективном, но рискованном,",
		"Возможностью поддерживать самооценку, «сохранить свое соци​альное лицо»"
	],
	[
		"Причастностью к «ближнему кругу» (приближенностью к команде руководителя),",
		"Нормативными показателями деятельности, в том числе и нормами профессиональной этики"
	],
	[
		"Возможностью оказывать влия​ние на других людей или ход событий,",
		"Обговоренной ранее трудовой нагрузкой"
	],
	[
		"Исполнением другими их обяза​тельств,",
		"Содержанием исполняемых обя​занностей"
	],
	[
		"Традициями организации, декла​рируемыми принципами и ценностями,",
		"Сроками исполнения своих обя​зательств"
	],
	[
		"Оценкой руководства,",
		"Возможностью оказывать влия​ние на других людей или ход событий"
	],
	[
		"Поддержанием собственной безопасности, стабильности положе​ния,",
		"Точным соответствием результа​та деятельности обговоренным пока​зателям"
	],
	[
		"Безопасностью (в широком смысле), стабильностью положения своих коллег,",
		"Удобством, комфортом, возмож​ностью минимизировать собственные усилия"
	],
	[
		"«Журавлем в небе», если под этим подразумевается участие в про​екте перспективном, но рискованном,",
		"Собственными принципами"
	],
	[
		"Исполнением другими их обяза​тельств,",
		"Возможностью получить более высокооплачиваемую работу"
	],
	[
		"Привычным порядком дел на предприятии,",
		"Возможностью поддерживать самооценку, «сохранить свое соци​альное лицо»"
	],
	[
		"Возможностью получить причи​тающееся материальное вознагражде​ние,",
		"«Журавлем в небе», если под этим подразумевается участие в проекте перспективном, но рискованном"
	],
	[
		"Возможностью сделать карьеру,",
		"Поддержкой своих друзей"
	],
	[
		"Возможностью оказывать влия​ние на других людей или ход событий,",
		"Привычным порядком дел на предприятии"
	],
	[
		"Нормативными показателями деятельности, в том числе и нормами профессиональной этики,",
		"336 «Журавлем в небе», если под этим под- разумевается участие в проекте перспективном, но рискованном"
	],
	[
		"Сроками исполнения своих обя​зательств,",
		"Безопасностью (в широком смысле), стабильностью положения своих коллег"
	],
	[
		"Возможностью сделать карьеру,",
		"Содержанием исполняемых обя​занностей"
	],
	[
		"Обговоренной ранее трудовой нагрузкой,",
		"Точным соответствием результа​та деятельности обговоренным пока​зателям"
	],
	[
		"Удобством, комфортом, возмож​ностью минимизировать собственные усилия,",
		"Традициями организации, декла​рируемыми принципами и ценностя​ми"
	],
	[
		"Собственными принципами,",
		"Причастностью к «ближнему кругу» (приближенностью к команде руководителя)"
	],
	[
		"Возможностью получить более высокооплачиваемую работу,",
		"Возможностью получить причи​тающееся материальное вознагражде​ние"
	],
	[
		"Возможностью поддерживать самооценку, «сохранить свое соци​альное лицо»,",
		"Оценкой руководства"
	],
	[
		"Поддержкой своих друзей,",
		"Возможностью оказывать влия​ние на других людей или ход событий"
	],
	[
		"Оценкой руководства,",
		"Нормативными показателями деятельности, в том числе и нормами профессиональной этики"
	],
	[
		"Причастностью к «ближнему кру​гу» (к команде руководителя),",
		"Сроками исполнения своих обя​зательств"
	],
	[
		"Традициями организации, декла​рируемыми принципами и ценностя​ми,",
		"Точным соответствием результа​та деятельности обговоренным пока​зателям"
	],
	[
		"Содержанием исполняемых обя​занностей,",
		"Обговоренной ранее трудовой нагрузкой"
	],
	[
		"Безопасностью (в широком смысле), стабильностью положения своих коллег,",
		"Собственными принципами"
	],
	[
		"Исполнением другими их обяза​тельств,",
		"Возможностью оказывать влия​ние на других людей или ход событий"
	],
	[
		"Привычным порядком дел на предприятии,",
		"Поддержкой своих друзей"
	],
	[
		"Возможностью сделать карьеру,",
		"Сроками исполнения своих обя​зательств"
	],
	[
		"Возможностью получить более высокооплачиваемую работу,",
		"Привычным порядком дел на предприятии"
	],
	[
		"Безопасностью (в широком смысле), стабильностью положения своих коллег,",
		"Возможностью получить причи​тающееся материальное вознагражде​ние"
	],
	[
		"Возможностью оказывать влия​ние на других людей или ход событий,",
		"«Журавлем в небе», если под этим под- разумевается участие в проекте перспективном, но рискованном"
	],
	[
		"Содержанием исполняемых обя​занностей,",
		"Привычным порядком дел на предприятии"
	],
	[
		"Удобством, комфортом, возмож​ностью минимизировать собственные усилия,",
		"Обговоренной ранее трудовой нагрузкой"
	],
	[
		"Нормативными показателями деятельности, в том числе и нормами профессиональной этики,",
		"Безопасностью (в широком смысле), стабильностью положения своих коллег"
	],
	[
		"Сроками исполнения своих обя​зательств,",
		"Поддержанием собственной безо-пасности, стабильности положе​ния"
	],
	[
		"Возможностью сделать карьеру,",
		"Исполнением другими их обяза​тельств"
	],
	[
		"Удобством, комфортом, возмож​ностью минимизировать собственные усилия,",
		"Причастностью к «ближнему кругу» (приближенностью к команде руководителя)"
	],
	[
		"Собственными принципами,",
		"Оценкой руководства"
	],
	[
		"«Журавлем в небе», если под этим подразумевается участие в проекте перспективном, но рискованном,",
		"Содержанием исполняемых обя​занностей"
	],
	[
		"Возможностью сделать карьеру,",
		"Возможностью получить более высокооплачиваемую работу"
	],
	[
		"Обговоренной ранее трудовой нагрузкой,",
		"Традициями организации, декла​рируемыми принципами и ценностями"
	],
	[
		"Исполнением другими их обяза​тельств,",
		"Сроками исполнения своих обя​зательств"
	],
	[
		"Возможностью поддерживать самооценку, «сохранить свое лицо»,",
		"Возможностью оказывать влия​ние на других людей или ход событий"
	],
	[
		"Поддержкой своих друзей,",
		"Нормативными показателями деятельности, в том числе и нормами профессиональной этики"
	],
	[
		"Точным соответствием результа​та деятельности обговоренным пока​зателям,",
		"Исполнением другими их обяза​тельств"
	],
	[
		"Обговоренной ранее трудовой нагрузкой,",
		"Собственными принципами"
	],
	[
		"Содержанием исполняемых обя​занностей,",
		"Поддержанием безопасности, стабильности положения своих коллег"
	],
	[
		"Оценкой руководства,",
		"Сроками исполнения своих обя​зательств"
	],
	[
		"Причастностью к «ближнему кругу» (приближенностью к команде руководителя),",
		"Точным соответствием результа​та деятельности обговоренным пока​зателям"
	],
	[
		"Поддержанием собственной безопасности, стабильности положе​ния,",
		"Собственными принципами"
	],
	[
		"«Журавлем в небе», если под этим подразумевается участие в про​екте потенциально перспективном, но достаточно рискованном,",
		"Возможностью получить более высокооплачиваемую работу"
	],
	[
		"Безопасностью (в широком смысле), стабильностью положения своих коллег,",
		"Возможностью поддерживать самооценку, «сохранить свое соци​альное лицо»"
	],
	[
		"«Журавлем в небе», если под этим подразумевается участие в проекте перспективном, но рискованном,",
		"746 Поддержкой своих друзей"
	],
	[
		"Привычным порядком дел на предприятии,",
		"Оценкой руководства"
	],
	[
		"Возможностью сделать карьеру,",
		"Причастностью к «ближнему кру​гу» (к команде руководителя)"
	],
	[
		"Возможностью оказывать влия​ние на других людей или ход событий,",
		"Традициями организации, декла​рируемыми принципами и ценностя​ми"
	],
	[
		"Нормативными показателями деятельности, в том числе и нормами профессиональной этики,",
		"Поддержанием собственной безопасности, стабильности положе​ния (в широком смысле)"
	],
	[
		"Причастностью к «ближнему кругу» (приближенностью к команде руководителя),",
		"Содержанием исполняемых обя​занностей"
	],
	[
		"Возможностью поддерживать самооценку, «сохранить свое лицо»,",
		"Обговоренной ранее трудовой нагрузкой"
	],
	[
		"Привычным порядком дел на предприятии,",
		"Исполнением другими их обяза​тельств"
	],
	[
		"Точным соответствием результа​та деятельности обговоренным пока​зателям,",
		"«Журавлем в небе», если под этим подразумевается участие в проекте перспективном, но рискованном"
	],
	[
		"Возможностью получить более высокооплачиваемую работу,",
		"Поддержанием безопасности, стабильности положения своих коллег"
	],
	[
		"Удобством, комфортом, возмож​ностью минимизировать собственные усилия,",
		"Привычным порядком дел на предприятии"
	],
	[
		"Собственными принципами,",
		"Возможностью сделать карьеру"
	],
	[
		"Возможностью поддерживать самооценку, «сохранить свое соци​альное лицо»,",
		"Сроками исполнения своих обя​зательств"
	],
	[
		"Обговоренной ранее трудовой нагрузкой,",
		"Возможностью сделать карьеру"
	],
	[
		"Традициями организации, декла​рируемыми принципами и ценностя​ми,",
		"Содержанием исполняемых обя​занностей"
	],
	[
		"«Журавлем в небе», если под этим подразумевается участие в проекте перспективном, но рискованном,",
		"Исполнением другими их обяза​тельств"
	],
	[
		"Поддержкой своих друзей,",
		"Возможностью поддерживать самооценку, «сохранить свое лицо»"
	],
	[
		"Возможностью получить причи​тающееся материальное вознагражде​ние,",
		"Поддержанием собственной безопасности, стабильности положе​ния (в широком смысле)"
	],
	[
		"Оценкой руководства,",
		"Точным соответствием результа​та деятельности обговоренным пока​зателям"
	],
	[
		"Причастностью к «ближнему кру​гу» (к команде руководителя),",
		"Возможностью оказывать влия​ние на других людей или ход событий"
	],
	[
		"Поддержанием собственной безо-пасности, стабильности положе​ния,",
		"Возможностью получить более высокооплачиваемую работу"
	],
	[
		"Обговоренной ранее трудовой нагрузкой,",
		"Причастностью к «ближнему кру​гу» (к команде руководителя)"
	],
	[
		"Содержанием исполняемых обя​занностей,",
		"Нормативными показателями деятельности, в том числе и нормами профессиональной этики"
	],
	[
		"Традициями организации, декла​рируемыми принципами и ценностями,",
		"Оценкой руководства"
	],
	[
		"Поддержкой своих друзей,",
		"Поддержанием собственной безопасности, стабильности положе​ния"
	],
	[
		"Безопасностью (в широком смысле), стабильностью положения своих коллег,",
		"Возможностью сделать карьеру"
	],
	[
		"Возможностью получить причи​тающееся материальное вознагражде​ние,",
		"Традициями организации, дек​ларируемыми принципами и ценно​стями"
	],
	[
		"«Журавлем в небе», если под этим подразумевается участие в проек-те перспективном, но рискованном,",
		"Причастностью к «ближнему кругу» (приближенностью к команде руководителя)"
	],
	[
		"Поддержанием собственной бе-зопасности, стабильности положе​ния,",
		"Исполнением другими их обяза​тельств"
	],
	[
		"Привычным порядком дел на предприятии,",
		"Сроками исполнения своих обя​зательств"
	],
	[
		"Возможностью сделать карьеру,",
		"Удобством, комфортом, воз​можностью минимизировать собст​венные усилия"
	],
	[
		"Возможностью получить более высокооплачиваемую работу,",
		"Традициями организации, декла​рируемыми принципами и ценностями"
	],
	[
		"Точным соответствием результата деятельности обговоренным условиям,",
		"Содержанием исполняемых обязанностей"
	],
	[
		"Обговоренной ранее трудовой нагрузкой,",
		"Поддержкой своих друзей"
	],
	[
		"Возможностью оказывать влия​ние на других людей или ход событий,",
		"Собственными принципами"
	],
	[
		"Возможностью получить причи​тающееся материальное вознагражде​ние,",
		"Причастностью к «ближнему кругу» (приближенностью к команде руководителя)"
	],
	[
		"Нормативными показателями деятельности, в том числе и нормами профессиональной этики,",
		"Возможностью поддерживать самооценку, «сохранить свое соци​альное лицо»"
	],
	[
		"Сроками исполнения своих обя​зательств,",
		"Поддержкой своих друзей"
	],
	[
		"Точным соответствиемрезульта​та деятельности обговоренным условиям,",
		"Удобством, комфортом, возможнос-тью минимизировать собст​венные усилия"
	],
	[
		"Традициями организации, декла​рируемыми принципами и ценностями,",
		"Оценкой руководства"
	],
	[
		"Поддержкой своих друзей,",
		"Поддержанием собственной безопасности, стабильности положе​ния"
	],
	[
		"Безопасностью (в широком смысле), стабильностью положения своих коллег,",
		"Возможностью сделать карьеру"
	],
	[
		"Возможностью получить причи​тающееся материальное вознагражде​ние,",
		"Традициями организации, дек​ларируемыми принципами и ценно​стями"
	],
	[
		"«Журавлем в небе», если под этим подразумевается участие в проекте перспективном, но рискованном,",
		"Причастностью к «ближнему кругу» (приближенностью к команде руководителя)"
	],
	[
		"Поддержанием собственной бе-зопасности, стабильности положе​ния,",
		"Исполнением другими их обяза​тельств"
	],
	[
		"Привычным порядком дел на предприятии,",
		"Сроками исполнения своих обя​зательств"
	],
	[
		"Возможностью сделать карьеру,",
		"Удобством, комфортом, воз​можностью минимизировать собст​венные усилия"
	],
	[
		"Возможностью получить более высокооплачиваемую работу,",
		"Традициями организации, декла​рируемыми принципами и ценностями"
	],
	[
		"Точным соответствием резуль​тата деятельности обговоренным по​казателям,",
		"Содержанием исполняемых обязанностей"
	],
	[
		"Обговоренной ранее трудовой нагрузкой,",
		"Поддержкой своих друзей"
	],
	[
		"Возможностью оказывать влия​ние на других людей или ход событий,",
		"Собственными принципами"
	],
	[
		"Возможностью получить причи​тающееся материальное вознагражде​ние,",
		"Причастностью к «ближнему кругу» (приближенностью к команде руководителя)"
	],
	[
		"Нормативными показателями деятельности, в том числе и нормами профессиональной этики,",
		"Возможностью поддерживать самооценку, «сохранить свое соци​альное лицо»"
	],
	[
		"Сроками исполнения своих обя​зательств,",
		"Поддержкой своих друзей"
	],
	[
		"Точным соответствием резуль​тата деятельности обговоренным по​казателям,",
		"Удобством, комфортом, воз​можностью минимизировать собст​венные усилия"
	],
	[
		"Причастностью к «ближнему кру​гу» (к команде руководителя),",
		"Поддержкой своих друзей"
	],
	[
		"Традициями организации, декла​рируемыми принципами и ценностями,",
		"Исполнением другими их обяза​тельств"
	],
	[
		"Собственными принципами,",
		"Привычным порядком дел на предприятии"
	],
	[
		"Оценкой руководства,",
		"Удобством, комфортом, воз​можностью минимизировать собст​венные усилия"
	],
	[
		"Возможностью получить причи​тающееся материальное вознагражде​ние,",
		"Собственными принципами"
	],
	[
		"Традициями организации, дек​ларируемыми принципами и ценно​стями,",
		"Нормативными показателями деятельности, в том числе и нормами профессиональной этики"
	],
	[
		"Поддержанием собственной бе-зопасности, стабильности положе​ния,",
		"Оценкой руководства"
	],
	[
		"Безопасностью (в широком смысле), стабильностью положения своих коллег,",
		"Причастностью к «ближнему кругу» (приближенностью к команде руководителя)"
	],
	[
		"Возможностью поддерживать самооценку, «сохранить свое лицо»,",
		"Собственными принципами"
	],
	[
		"Поддержкой своих друзей,",
		"Возможностью получить более высокооплачиваемую работу"
	],
	[
		"Удобством, комфортом, воз​можностью минимизировать собст​венные усилия,",
		"Возможностью получить причи​тающееся материальное вознагражде​ние"
	],
	[
		"«Журавлем в небе», если под этим подразумевается участие в проек-те перспективном, но рискованном,",
		"Традициями организации, дек​ларируемыми принципами и ценно​стями"
	],
	[
		"Возможностью получить причи​тающееся материальное вознагражде​ние,",
		"Точным соответствием резуль​тата деятельности обговоренным по​казателям"
	],
	[
		"Стабильностью дел на предприя​тии,",
		"Поддержанием собственной безопасности, стабильности положе​ния (в широком смысле)"
	],
	[
		"Точным соответствием результата деятельности обговоренным условиям,",
		"Поддержкой своих друзей"
	],
	[
		"Возможностью сделать карьеру,",
		"«Журавлем в небе», если под этим подразумевается участие в проекте перспективном, но рискованном"
	],
	[
		"Содержанием исполняемых обязанностей,",
		"Удобством, комфортом, воз​можностью минимизировать собст​венные усилия"
	],
	[
		"Сроками исполнения своих обя​зательств,",
		"Возможностью получить причи​тающееся материальное вознагражде​ние"
	],
	[
		"Возможностью получить более высокооплачиваемую работу,",
		"Возможностью поддерживать самооценку, «сохранить свое соци​альное лицо»"
	],
	[
		"Привычным порядком дел на предприятии,",
		"Безопасностью (в широком смысле), стабильностью положения своих коллег"
	],
	[
		"Поддержкой своих друзей,",
		"Исполнением другими их обяза​тельств"
	],
	[
		"Нормативными показателями деятельности, в том числе и нормами профессиональной этики,",
		"Собственными принципами"
	],
	[
		"Сроками исполнения своих обя​зательств,",
		"Возможностью оказывать влия​ние на других людей или ход событий"
	],
	[
		"Удобством, комфортом, воз​можностью минимизировать собст​венные усилия,",
		"Собственными принципами"
	],
	[
		"Поддержанием собственной бе-зопасности, стабильности положе​ния,",
		"Возможностью сделать карьеру"
	],
	[
		"Точным соответствием результа​та деятельности обговоренным условиям,",
		"Возможностью получить более высокооплачиваемую работу"
	],
	[
		"Обговоренной ранее трудовой нагрузкой,",
		"«Журавлем в небе», если под этим подразумевается участие в проекте перспективном, но рискованном"
	],
	[
		"Возможностью оказывать влия​ние на других людей или ход событий,",
		"Безопасностью (в широком смысле), стабильностью положения своих коллег"
	],
	[
		"Нормативными показателями деятельности, в том числе и нормами профессиональной этики,",
		"Исполнением другими их обяза​тельств"
	],
	[
		"Поддержанием собственной безопасности, стабильности положе​ния (в широком смысле),",
		"Содержанием исполняемых обязанностей"
	],
	[
		"Поддержкой своих друзей,",
		"Удобством, комфортом, воз​можностью минимизировать собст​венные усилия"
	],
	[
		"Оценкой руководства,",
		"Причастностью к «ближнему кру​гу» (к команде руководителя)"
	],
	[
		"Собственными принципами,",
		"Возможностью получить более высокооплачиваемую работу"
	],
	[
		"Традициями организации, дек​ларируемыми принципами и ценно​стями,",
		"Возможностью поддерживать самооценку, «сохранить свое соци​альное лицо»"
	],
	[
		"Поддержанием собственной бе-зопасности, стабильности положе​ния (в широком смысле),",
		"Возможностью оказывать влия​ние на других людей или ход событий"
	],
	[
		"«Журавлем в небе», если под этим подразумевается участие в проек-те перспективном, но рискованном,",
		"Удобством, комфортом, воз​можностью минимизировать собст​венные усилия"
	],
	[
		"Возможностью сделать карьеру,",
		"Традициями организации, дек​ларируемыми принципами и ценно​стями"
	],
	[
		"Поддержанием собственной бе-зопасности, стабильности положе​ния,",
		"Содержанием исполняемых обязанностей"
	],
	[
		"Поддержкой своих друзей,",
		"Удобством, комфортом, воз​можностью минимизировать собст​венные усилия"
	],
	[
		"Оценкой руководства,",
		"Причастностью к «ближнему кру​гу» (к команде руководителя)"
	],
	[
		"Собственными принципами,",
		"Возможностью получить более высокооплачиваемую работу"
	],
	[
		"Традициями организации, дек​ларируемыми принципами и ценно​стями,",
		"Возможностью поддерживать самооценку, «сохранить свое соци​альное лицо»"
	],
	[
		"Поддержанием собственной бе-зопасности, стабильности положе​ния,",
		"Возможностью оказывать влия​ние на других людей или ход событий"
	],
	[
		"«Журавлем в небе», если под этим подразумевается участие в проек-те перспективном, но рискованном,",
		"Удобством, комфортом, воз​можностью минимизировать собст​венные усилия"
	],
	[
		"Безопасностью (в широком смысле), стабильностью положения своих коллег,",
		"«Журавлем в небе», если под этим подразумевается участие в проекте перспективном, но рискованном"
	],
	[
		"Сроками исполнения своих обя​зательств,",
		"Удобством, комфортом, воз​можностью минимизировать собст​венные усилия"
	],
	[
		"Содержанием своих обязанностей,",
		"Оценкой руководства"
	],
	[
		"Точным соответствием результа​та деятельности обговоренным условиям,",
		"Привычным порядком дел на предприятии"
	],
	[
		"Возможностью оказывать влия​ние на других людей или ход событий,",
		"Возможностью получить причи​тающееся материальное вознагражде​ние"
	],

	[
		"Поддержанием безопасности, стабильности положения своих коллег,",
		"Обговоренной ранее трудовой нагрузкой"
	],
	[
		"Возможностью поддерживать самооценку, «сохранить свое лицо»,",
		"Поддержанием собственной безопасности, стабильности положе​ния"
	],
	[
		"Поддержкой своих друзей,",
		"Традициями организации, дек​ларируемыми принципами и ценно​стями"
	],
	[
		"Собственными принципами,",
		"Исполнением другими их обяза​тельств"
	],
	[
		"Оценкой руководства,",
		"Безопасностью (в широком смысле), стабильностью положения своих коллег"
	],
	[
		"Нормативными показателями деятельности, в том числе и нормами профессиональной этики,",
		"Возможностью получить более высокооплачиваемую работу"
	],
	[
		"Возможностью сделать карьеру,",
		"Возможностью поддерживать самооценку, «сохранить свое лицо»"
	],
	[
		"Поддержкой своих друзей,",
		"Содержанием исполняемых обязанностей"
	],
	[
		"Причастностью к «ближнему кругу» (приближенностью к команде руководителя),",
		"Поддержанием собственной безопасности, стабильности положе​ния (в широком смысле)"
	],
	[
		"Традициями организации, дек​ларируемыми принципами и ценно​стями,",
		"Привычным порядком дел на предприятии"
	],
	[
		"Оценкой руководства,",
		"Обговоренной ранее трудовой нагрузкой"
	],
	[
		"Возможностью сделать карьеру,",
		"Точным соответствием резуль​тата деятельности обговоренным по​казателям"
	],
	[
		"Возможностью оказывать влия​ние на других людей или ход событий,",
		"Удобством, комфортом, воз​можностью минимизировать собст​венные усилия"
	],
	[
		"Безопасностью (в широком смысле), стабильностью положения своих коллег,",
		"Поддержкой своих друзей"
	],
	[
		"Привычным порядком дел на предприятии,",
		"«Журавлем в небе», если под этим подразумевается участие в проекте перспективном, но рискованном"
	],
	[
		"Нормативными показателями деятельности, в том числе и нормами профессиональной этики,",
		"Точным соответствием резуль​тата деятельности обговоренным по​казателям"
	],
	[
		"Возможностью получить более высокооплачиваемую работу,",
		"Возможностью оказывать влия​ние на других людей или ход событий"
	],
	[
		"«Журавлем в небе», если под этим подразумевается участие в про​екте перспективном, но рискованном,",
		"Поддержанием собственной безопасности, стабильности положе​ния (в широком смысле)"
	],
	[
		"Удобством, комфортом, воз​можностью минимизировать собст​венные усилия,",
		"Нормативными показателями деятельности, в том числе и нормами профессиональной этики"
	],
	[
		"Содержанием исполняемых обязанностей,",
		"Возможностью поддерживать самооценку, «сохранить свое лицо»"
	],
	[
		"Оценкой руководства,",
		"Возможностью сделать карьеру"
	],
	[
		"Причастностью к «ближнему кру​гу» (к команде руководителя),",
		"Традициями организации, дек​ларируемыми принципами и ценно​стями"
	],
	[
		"Обговоренной ранее трудовой нагрузкой,",
		"Поддержанием собственной безопасности, стабильности положе​ния"
	],
	[
		"Возможностью получить причи​тающееся материальное вознагражде​ние,",
		"Нормативными показателями деятельности, в том числе и нормами профессиональной этики"
	],
	[
		"Собственными принципами,",
		"Сроками исполнения своих обя​зательств"
	],
	[
		"Удобством, комфортом, воз​можностью минимизировать собст​венные усилия,",
		"Исполнением другими их обяза​тельств"
	],
	[
		"«Журавлем в небе», если под этим подразумевается участие в про​екте потенциально перспективном, но достаточно рискованном,",
		"Оценкой руководства"
	],
	[
		"Возможностью получить более высокооплачиваемую работу,",
		"Удобством, комфортом, воз​можностью минимизировать собст​венные усилия"
	],
	[
		"Традициями организации, дек​ларируемыми принципами и ценно​стями,",
		"Безопасностью (в широком смысле), стабильностью положения своих коллег"
	],
	[
		"Возможностью получить причи​тающееся материальное вознагражде​ние,",
		"Возможностью сделать карьеру"
	],
	[
		"Точным соответствием результа​та деятельности обговоренным условиям,",
		"Возможностью поддерживать самооценку, «сохранить свое соци​альное лицо»"
	],
	[
		"Содержанием исполняемых обязанностей,",
		"Сроками исполнения своих обя​зательств"
	],
	[
		"Исполнением другими их обяза​тельств,",
		"Обговоренной ранее трудовой нагрузкой"
	]
]
';
//print_r( json_decode($json) );
?>

<div class="col-md-8">

    <div class="col-md-12">

        <h3 class="mb-0">Тест для инмерения ресурсов установок-регуляторов взаимодействия</h3>

        <br>

        <form action="" method="post">

            <? foreach ( json_decode($json) as $key_item => $item ): ?>

                <?  #Рандомное заполнение
                unset($a);unset($b);
                $rand = rand( 1 , 2 );
                // if ( $this->GET[1] == 'random' )
                // if( $rand == 1)
                // $a = 'checked="checked"';
                // else
                // $b = 'checked="checked"';

                if( $rand == 1):
                    $a = 'checked="checked"';
                else:
                    $b = 'checked="checked"';
                endif;
                ?>

                <p id="question_1" class="card-text mb-auto"> <b><?=$key_item+1?>)</b> <br>
                    <div class="radio"><label><input type="radio" value="А" name="<?=$key_item+1?>" <?=$a?> required> <?=$item[0]?></label></div>
                    <div class="radio"><label><input type="radio" value="Б" name="<?=$key_item+1?>" <?=$b?> > <?=$item[1]?></label></div>
                </p>

            <? endforeach; ?>

            <button name="testing_end" type="submit" class="btn btn-success" value="2">Получить результат</button>

        </form>

    </div>




</div>

<aside class="col-md-4 blog-sidebar">
    <style>
        #aside1 {  /* селектор блока, который будет оставаться на месте */
            position: fixed;
            z-index: 101;
        }
        #top_nav{
            /*top: 120px;*/
            position: fixed;
            z-index: 999;
        }
    </style>
    <div class="bd-example" id="top_nav">

        <?
        $i=0;
        foreach ( json_decode($json) as $key_item => $item ){

            if($i==9){
            echo '<br>';
                $i=0;
            }
            if($i==0){
                echo '';
            }
                echo '<span class="badge badge-light badge-pill">'.$key_item.'</span>';

            $i++;
        }
        ?>


    </div>
    <!--
    <div class="p-3" style="position: fixed;">

        <h5 class="font-italic">Вопросы</h5>

        <div class="p-3 mb-3 bg-light rounded">

            <nav aria-label="...">
                <ul class="pagination">

                    <li class="page-item active"><a class="page-link" href="#question_1">1</a></li>
                    <li class="page-item"><a class="page-link" href="#question_2">2</a></li>
                    <li class="page-item"><a class="page-link" href="#question_3">3</a></li>
                    <li class="page-item"><a class="page-link" href="#question_4">4</a></li>
                    <li class="page-item"><a class="page-link" href="#question_5">5</a></li>
                    <li class="page-item"><a class="page-link" href="#question_6">6</a></li>
                    <li class="page-item"><a class="page-link" href="#question_7">7</a></li>
                    <li class="page-item"><a class="page-link" href="#question_8">8</a></li>
                    <li class="page-item"><a class="page-link" href="#question_9">9</a></li>
                    <li class="page-item"><a class="page-link" href="#question_10">10</a></li>

                </ul>
                <ul class="pagination">

                    <li class="page-item"><a class="page-link" href="#question_11">11</a></li>
                    <li class="page-item"><a class="page-link" href="#question_12">12</a></li>
                    <li class="page-item"><a class="page-link" href="#question_13">13</a></li>
                    <li class="page-item"><a class="page-link" href="#question_14">14</a></li>
                    <li class="page-item"><a class="page-link" href="#question_15">15</a></li>
                    <li class="page-item"><a class="page-link" href="#question_16">16</a></li>
                    <li class="page-item"><a class="page-link" href="#question_17">17</a></li>
                    <li class="page-item"><a class="page-link" href="#question_18">18</a></li>

                </ul>

                <ul class="pagination">

                    <li class="page-item"><a class="page-link" href="#question_19">19</a></li>
                    <li class="page-item"><a class="page-link" href="#question_20">20</a></li>
                    <li class="page-item"><a class="page-link" href="#question_21">21</a></li>
                    <li class="page-item"><a class="page-link" href="#question_22">22</a></li>
                    <li class="page-item"><a class="page-link" href="#question_23">23</a></li>
                    <li class="page-item"><a class="page-link" href="#question_24">24</a></li>
                    <li class="page-item"><a class="page-link" href="#question_25">25</a></li>
                    <li class="page-item"><a class="page-link" href="#question_26">26</a></li>

                </ul>

                <ul class="pagination">

                    <li class="page-item"><a class="page-link" href="#question_27">27</a></li>
                    <li class="page-item"><a class="page-link" href="#question_28">28</a></li>

                </ul>


            </nav>

        </div>

    </div>

    -->

</aside>
