<!-- Подключение хедера -->
<? $this->includes('header'); ?>

<div style="padding-top: 20px;"></div>

<main role="main" class="container">
    <div class="row">

        <div class="col-md-1 blog-main">

        </div>
        <div class="col-md-10 blog-main">

            <div class="blog-post">

                <h2>Добро пожаловать на интернет-ресурс Atos-isi.com</h2>

                <p>
                    Психолог, основоположник научного направления, академик Авдеев Василий Васильевич предлагает авторскую технологию оптимизации самореализации – интегратор совпадающих интересов (АТОС-ИСИ), далее Технология.
                </p>

                <p>
                    Инструментальными средствами данной Технологии, в формате инновационной обучающей услуги: <b>«Успешная самореализация»</b> - версия 01, осуществляется возможность освоения контента Технологии, с одной стороны, работниками компаний и учреждений, в том числе и лицами, мотивированными на вхождение в кадровый резерв, с другой - лицами, ориентированными на самосовершенствование и эффективную реализацию персональной жизненной стратегии.
                </p>

                <p>
                    Интернет-ресурс  <ins><a href="/home/" style="color: #005cbf;">atos-isi.com</a></ins> предназначается для обеспечения самостоятельного дистанционного освоения Технологии и пользования ее контентом, чем обусловливается интеграция совпадающих интересов как для продуктивной функциональной деятельности, так и для эффективной реализации персональной жизненной стратегии.
                </p>


                <h4>Данная услуга привлекательна.</h4>
                <b>Во-первых:</b>
                <p>а) для руководителей компаний и учреждений, ориентированных на успешный бизнес и
                    эффективность работы учреждений, а также на харизматический рост;</p>
                <p>б) для руководителей служб по работе с персоналом (или подобных подразделений) в компаниях
                    и учреждениях, ориентированных на увеличение управленческой прибыли и эффективности
                    работы учреждений, а также на карьерный рост;</p>
                <p>в) для сотрудников, ориентированных как достижение экспертной квалификации, так и
                    увеличение возможностей участия в выполнении проектных работ.
                    </p>
                <b>Во-вторых:</b>
                <p>а) для лиц, ориентированных на успешную профессиональную деятельность и эффективную
                    самореализацию в жизнедеятельности;</p>

                <p>б) для студентов и учащихся старших классов, ориентированных на поступление в ВУЗ, а в
                последующем - на успешную самореализацию в жизнедеятельности.</p>
                <p>в) для родителей и учащихся средних классов ориентированных, преимущественно, как на
                повышение культуры поведения («точечное» замещение как жестких, так и протестных форм
                поведения, позитивным поведением), так и на формирование навыка решения задач,
                обусловливающих увеличение потенциала общих умственных способностей.</p>

                <ol>
                    <li><a href="/button/1/" style="color: #005cbf;"><ins><b>Презентация контента Технологии</b></ins></a></li>
                    <li><a href="/button/2/" style="color: #005cbf;"><ins><b>Освоение контента Технологии</b></ins></a></li>
                    <li><a href="/button/3/" style="color: #005cbf;"><ins><b>Пользование контентом Технологии</b></ins></a></li>
                    <li><a href="/button/4/" style="color: #005cbf;"><ins><b>Дополнительная информация</b></ins></a></li>
                </ol>

                <p style="color: #003166; font-size: 20px;"><b>
                    Для ознакомления с коротким сообщением об услуге: «Успешная самореализация» - кликать по кнопке «4 Дополнительная информация».
                    </b></p>

                <p class="blog-post-meta">© В.В. Авдеев, 2018</p>

        </div>

    </div>

</main>

<!-- Подключение футера -->
<? $this->includes('footer'); ?>